export type CookieInfo = {
  id: string;
  name: string;
  description: string;
  ingredients: string[];
  image: string;
};

export const COOKIES: CookieInfo[] = [
  {
    id: "red-velvet",
    name: "Red Velvet Cheesecake",
    description:
      "Любов от пръв залък - кадифена бисквитка с бял шоколад и нежно кремообразно сърце. Всеки залък е сладък контраст между смелост и нежност.",
    ingredients: [
      "Пшенично брашно",
      "Захар",
      "Кафява захар",
      "Масло",
      "Бял шоколад ",
      "Крема сирене",
      "Яйца",
      "Набухватели",
      "Оцветител",
    ],
    image: "/red-velvet-cookie-top.png",
  },
  {
    id: "oreo",
    name: "Oreo & White Choc",
    description:
      "Хрупкава, кремообразна и дръзка — бисквитка с бял шоколад и натрошени Oreo. Перфектен баланс между сладка плътност и хрупкав хаос във всеки залък.",
    ingredients: [
      "Пшенично брашно",
      "Захар",
      "Кафява захар",
      "Масло",
      "Яйца",
      "Oreo",
      "Бял шоколад",
      "Набухватели",
    ],
    image: "/oreo-cookie-top.png",
  },
  {
    id: "nutella-bueno",
    name: "Nutella Bueno",
    description:
      "Плътна, топла и безсрамно шоколадова - с млечен шоколад, хрупкаво Bueno парче и течен център от Nutella. Мека отвътре и леко карамелизирана по краищата - сладка лудост, която не искаш да свършва.",
    ingredients: [
      "Пшенично брашно",
      "Захар",
      "Кафява захар",
      "Масло",
      "Яйца",
      "Млечен шоколад",
      "Nutella",
      "Bueno",
      "Набухватели",
    ],
    image: "/nutella-bueno-top.png",
  },
  {
    id: "biscoff",
    name: "Biscoff & White Choc",
    description:
      "Маслена, карамелена и изкушаващо нежна - с бял шоколад, златисти Biscoff парченца и разливащ се кремообразен център. Това е сладост, която лесно се превръща в зависимост - без грам съжаление.",
    ingredients: [
      "Пшенично брашно",
      "Захар",
      "Кафява захар",
      "Масло",
      "Бял шоколад",
      "Бисквити Lotus",
      "Яйца",
      "Lotus крем",
      "Набухватели",
    ],
    image: "/biscoff-top.png",
  },
  {
    id: "new-york",
    name: "New York",
    description:
      "Мек център, леко хрупкав ръб и аромат на масло и шоколад, който изпълва въздуха. Парченцата орех придават дълбочина и топлина - точно като домашно изпечена сладост от детството, само че още по-богата.",
    ingredients: [
      "Пшенично брашно",
      "Захар",
      "Кафява захар",
      "Масло",
      "Черен шоколад",
      "Яйца",
      "Орехи",
      "Набухватели",
    ],
    image: "/new-york-top.png",
  },
  {
    id: "triple-choc",
    name: "Tripple Choc",
    description:
      "Мек център, леко хрупкав ръб и наситен аромат на тъмно какао. Вътре се топят парченца черен и млечен шоколад - малък ритуал на шоколадово удоволствие във всеки залък.",
    ingredients: [
      "Пшенично брашно",
      "Захар",
      "Масло",
      "Яйца",
      "Черен и млечен шоколад",
      "Какао",
      "Царевично нишесте",
      "Набухватели",
    ],
    image: "/tripple-choc-top.png",
  },
];
